app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Article more than 5 characters"], ["body", "6 Characters"], ["created_at", "2021-05-17 05:39:39.827258"], ["updated_at", "2021-05-17 05:39:39.827258"]]
---
    def create

        @article = Article.new(article_params)

        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]
---
    def delete
        @article = Article.find(params[:id])
        @article.destroy